data/WS-Addressing/ws-addressing-50.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s12/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:9cd026fa-053a-4787-a911-4d55a6d77fcf</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/none</Address></ReplyTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/echoIn</Action></S:Header><S:Body><ns2:echoIn xmlns:ns2="http://example.org/echo" xmlns="http://example.org/notify">test1236</ns2:echoIn></S:Body></S:Envelope>